<?php

use Illuminate\Database\Seeder;

class DepartmentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('departments')->insert([
            [
                'name' => '技术部',
                'introduction' => '技术部主要负责对百步梯网站、软件的开发与维护。用键盘敲击精彩，用代码续写辉煌。'
            ],
            [
                'name' => '视频部',
                'introduction' => '用DV看世界，用影像记录一切。华工最前沿的新闻记者，最专业的视频制作团队，这里追踪时事热点，这里记录校园生活。“关注华工生活，反映同学心声”是我们永远的宗旨。只要你有热情，只要你有想法，只要你有理想，用小小视频拍出大大世界~~百步梯视频部，用DV来FUN转你的视界'
            ],
            [
                'name' => '节目部',
                'introduction' => '请打开耳朵，我们的声音之旅从这里起航。每天下午五点三十分，陪伴你的校园广播。或许你有好的声音，或许你有好的创意，或许你有好的文采，又或许，你认为这里需要你，而你也需要这里。百步梯节目部，期待你的加入，用声音与你分享生活。'
            ],
            [
                'name' => '外联部',
                'introduction' => '外联部是百步梯对外交流的窗口，我们本着勇于挑战、自信乐观的宗旨，力求以最完美的公关形象展现百步梯的风采。作为与社会联系最紧密的部门，我们主要负责与企业进行公关洽谈、高校间信息交流互通、与各大媒体紧密合作以及配合其他部门举办活动。我们是一支智慧与实干相结合的优秀公关团队，并始终以广阔的社会视角担任好百步梯的“外交使者”。'
            ],
            [
                'name' => '视觉设计部',
                'introduction' => '想展示自己的才华？想挥洒热血的青春？想被更多的人认可自己的创意？这里是百步梯直接宣传推广的平台，我们喜欢有FEEL的海报，喜欢充满创意的绘板，一同学习一同成长。用你的细腻传递美的触感，我们期待你的加入。'
            ],
            [
                'name' => '综合新闻部',
                'introduction' => '在这里的人们具有一流的人格素养和生活触觉，以及引以为豪的专业技术。当你像魔术师一样操控灵动的文字和照片的时候，你不仅仅在记录生活，更是在书写历史。'
            ],
            [
                'name' => '策划推广部',
                'introduction' => '我们负责策划、筹备和执行百步梯各品牌活动如“雕刻时光”电影盛典、光迹涂鸦和二手市场等。并成功让这些活动跻身于华园最受欢迎活动的行列中。此外，我们还肩负着统筹百步梯内部资源向师生推广百步梯的责任。我们是百步梯活动与推广的总设计师。相信自己，你的每一丝创意都将汇集成我们最具创意的活动！你能行！'
            ],
            [
                'name' => '综合管理部',
                'introduction' => '综合管理部以求是严谨、开拓创新为行为准则，在建立完善物资、财务、人力、行政会务四项制度的同时，肩负着百步梯内部活动的策划与组织的职责。我们是BBT庞大的根系，手手相牵，沟通各部门，深扎于彼此。而有了你，我们相信我们能在百步梯登上第101阶，综合管理部期待你的加入！'
            ],
            [
                'name' => '编辑部',
                'introduction' => '爱报纸的你？想编杂志的你？苦于没有展示平台的你？编辑部欢迎你！精美的杂志？专业的报纸？美幻的特色期刊？给力的网站运营？有趣的个性摄影？犀利的专题报道？没错，这是我们编辑部做的！加入我们！这也即将是你做的！'
            ],
            [
                'name' => '人力资源部',
                'introduction' => '“人”聚于此，“力”为百步梯！我们负责百步梯的人员培训、管理和考核；我们努力挖掘每一个部门和每一位BBTer的潜力；我们致力于建设百步梯的内外文化、营造部门团结友爱的氛围、加强各部门间的沟通与合作。我们旨在用心凝聚“人”的力量，让百步梯“创新，只为与你分享生活”的宗旨真正溢满华园。'
            ],
        ]);
    }
}
